//
//  Requirements.swift
//  MikeTsyba-ITEA-Diplom
//
//  Created by Mykhailo Tsyba on 11/30/19.
//  Copyright © 2019 miketsyba. All rights reserved.
//

import Foundation

class Requirements {
	//MARK: - Cathedrals
	var allCathedrals = "All"
	var mobDev = "Mobile Development"
	var feDev = "Front End Development"
	var design = "Design"
	var qa = "QA"
	var other = "Other"
	var programming = "Programming"

	//MARK: - Faculties
	var ios = "iOS"
	var android = "Android"
	var react = "React"
	var fe = "Front End"
	var js = "JS"
	var wd = "Web Design"
	var testing = "Testing"
	var dm = "Digital Marketing"
	var pm = "Project Management"
	var genProgramming = "General Programming"

	//MARK: - Courses
	//MARK: - Courses
	var iosBasic = """
		Наличие собственного ноутбука для занятий в аудиториях
		Базовые знания и опыт алгоритмического программирования (Паскаль, С/С++)
		Английский уровня Elementary
		Знание основ теории программирования
	"""
	var iosAdvanced = """
		Уверенное знание языка Swift
		Опыт работы с основными классами платформы iOS
		Умение пользоваться документацией, читать и понимать сторонний код
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var androidBasic = """
		Владение синтаксисом Java
		Наличие алгоритмического мышления
		Желательно понимание основ теории дизайна
		Наличие собственного ноутбука для занятий в аудиториях
		Знание основ теории программирования
	"""
	var androidAdvanced = """
		Пройденный курс «Программирование под Android (базовый)»
		Наличие опыта создания простых приложений
		Качественное выполнение тестового задания
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var reactBasic = """
		Уверенное знание JavaScript
		Знание CSS
		Умение работать с системой контроля версий
		Опыт работы с другим фреймворком на JavaScript: Babel.js и ECMAScript
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var reactAdvanced = """
		Уверенное знание JavaScript
		Опыт работы с React Native
		Умение работать с системой контроля версий
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var htmlCss = """
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var jsBasic = """
		Уверенное владение персональным компьютером
		Навыки работы с текстовыми редакторами
		Знание HTML, CSS
		Наличие собственного ноутбука для занятий в аудиториях
		Знание основ теории программирования
	"""
	var jsAdvanced = """
		Наличие собственного ноутбука для занятий в аудиториях
		Знание основ HTML
		Знание основ JavaScript
	"""
	var ui = """
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var ux = """
		Наличие собственного ноутбука для занятий в аудиториях
		Базовое владение Adobe Photoshop / Illustrator
		Design Fundamentals
		Дополнительный софт (Figma, Miro, Sketch)
	"""
	var tilda = """
		Уверенный пользователь ПК
		Наличие опыта и знаний пакета Adobe будет плюсом
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var qaBasic = """
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var qaAdvanced = """
		Понимание важности тестирования как неотъемлемой части разработки и внедрения программных продуктов
		Умение использовать на практике все виды и уровни тестов
		Умение находить баги и писать отчеты о них
		Умение создавать тест-кейсы и правильно их объединять в наборы
		Понимания стадий QA-процесса
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var qaAutomation = """
		Базовые знания программирования
		Базовые знания по тестированию
		Уверенный пользователь ПК
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var smm = """
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var emailMarketing = """
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var profPm = """
		Опыт управления проектами - 1 год
		Базовые теоретические знания об управлении проектами
		Наличие собственного ноутбука для занятий в аудиториях
		Для тех, кто планирует сдавать экзамен на сертификат PMP важно наличие подтвержденного опыта управления проектами от 3х лет
	"""
	var agileScrum = """
		Желание погрузиться в мир гибких подходов
		Желание попробовать scrum на практике в игровой форме
		Наличие собственного ноутбука для занятий в аудиториях
	"""
	var progBasic = """
		Наличие собственного ноутбука для занятий в аудиториях
	"""
}
